names = {
    'иванов': 10000.0,
    'петров': 15000.0,
    'сидоров': 25000.1,
    'иванова': 15000.7,
    'петрова': 19000.9,
    'сидорова': 26000.1,
    'октябрьский': 30000.5,
    'петровский': 26000.4,
    'знаменский': 12000.0,
    'корецкий': 31000.9

}

with open('task3.txt', 'w', encoding='utf-8') as file:
    for k, v in names.items():
        print(k, v, file=file)
        if v<20000:
            print(f'{k} имеет зарплату менее 20 тысяч ')


print(f'средняя зарплата составляет: {sum(names.values())/len(names)}')